In [1]:
import pandas as pd

In [2]:
file_path ="Client-Data.csv"
file_path

'Client-Data.csv'

In [3]:
df=pd.read_csv(file_path)
print(df.head())

      Name  Age     Sex age_group   Location
0  Dhanush   25    Male     minor  Bengaluru
1    Rohan   20    Male    Junior   New York
2     Riya   32  Female     adult     Mumbai
3    Virat   30    Male    middle      Delhi
4    Sonam   40  Female    senior       Pune

In [4]:
df.index=pd.RangeIndex(start=1, stop=len(df)+1, step=1)
print(df.head())

      Name  Age     Sex age_group   Location
1  Dhanush   25    Male     minor  Bengaluru
2    Rohan   20    Male    Junior   New York
3     Riya   32  Female     adult     Mumbai
4    Virat   30    Male    middle      Delhi
5    Sonam   40  Female    senior       Pune

In [5]:
df=df.drop(columns=['age_group'],inplace=False)

In [6]:
df.columns

Index(['Name', 'Age', 'Sex', 'Location'], dtype='object')

In [7]:
df.drop(columns=['Location'],inplace=True)

In [8]:
df.head()

      Name  Age     Sex
1  Dhanush   25    Male
2    Rohan   20    Male
3     Riya   32  Female
4    Virat   30    Male
5    Sonam   40  Female

In [9]:
def addition(row):
    if (row['Age']>20 and row['Age']<=25):
        return 'Minor'
    elif (row['Age']>25 and row['Age']<32):
        return 'Middle'
    else:
        return 'Above-Aged'

In [10]:
df['category']=df.apply(addition,axis=1)

In [11]:
df.head()

      Name  Age     Sex    category
1  Dhanush   25    Male       Minor
2    Rohan   20    Male  Above-Aged
3     Riya   32  Female  Above-Aged
4    Virat   30    Male      Middle
5    Sonam   40  Female  Above-Aged

In [12]:
df['NetWorth(cr)']=['100','200','450','150','650','500']
df.head()

      Name  Age     Sex    category NetWorth(cr)
1  Dhanush   25    Male       Minor          100
2    Rohan   20    Male  Above-Aged          200
3     Riya   32  Female  Above-Aged          450
4    Virat   30    Male      Middle          150
5    Sonam   40  Female  Above-Aged          650

In [27]:
df['Status'] = pd.cut(df['Age'], bins=[20, 25, 30, 32, 40, 50], 
                      labels=['Overachiever', 'Goodachiever', 'Greatachiever', 'Superachiever', 'Ultrachiever'], 
                      right=False)

In [28]:
df.head()

      Name  Age     Sex    category NetWorth(cr)         Status
1  Dhanush   25    Male       Minor          100   Goodachiever
2    Rohan   20    Male  Above-Aged          200   Overachiever
3     Riya   32  Female  Above-Aged          450  Superachiever
4    Virat   30    Male      Middle          150  Greatachiever
5    Sonam   40  Female  Above-Aged          650   Ultrachiever